SELECT distinct
  CONCAT(YEAR(n_m.push_date), '_', MONTH(n_m.push_date)) Год_месяц,
  n_m.push_date Дата_нажатия,
  n_m.user_name Код_пользователя,
  n_m.item_num Артикул,
  n_m.item_name Название_товара,
  n_m.qty К_во_товара_ед_изм,
  n_m.s_qty К_во_товара_сумм_ед_изм,
  n_m.whse_num Код_склада_отгрузки,
  n_m.decision Комментарий_решения,
  n_m.decision2 Комментарий_решения2,
  n_m.decision3 Комментарий_решения3,
  n_m.id ID_строки_таблицы,
  n_m.b Код_комментария_решения
FROM
  SERVERUS.nika_m n_m
WHERE
      ( n_m.push_date BETWEEN str_to_date((@Prompt('1. Дата начала периода','A',,mono,free)),'%d.%m.%Y')
                          AND str_to_date((@Prompt('2. Дата окончания периода','A',,mono,free) ),'%d.%m.%Y') )
  AND ( n_m.user_name NOT IN ('liv64') )
  
  
  
  
  
  
  
  
  
  ---------------------------------------
  with art1 as (
		SELECT 
			ITEM_NUM Артикул,
			max( V_DATE) Дата_смены,
			IND_CATEGORY  новая_категория
		FROM KDW.DW_PRICE_HISTORY
		WHERE 
			V_DATE >=SYSDATE - 14
			-- and state='1'
			and (HSZ='064' or HSZ='Т33')
			AND ( DIV_CODE IN @Prompt('1. ТР','A',{'все', 'Т44', 'Т45', 'Т46', 'Т50', 'Т51', 'Т54', 'Т55', 'Т56', 'Т57', 'Т58', 'Т59', 'Т78', 'Т79', 'Т80', 'Т81', 'Т82', 'Т83', 'Т84', 'Т85', 'Т86', 'Т87', 'Т91', 'Т92', 'Т93', 'Т33', 'Т32', 'Т21', 'Т90', 'Т94', 'Т96', 'Т97', 'Т98', 'Т99', 'Т95', 'Т100'},multi,free)
						 OR 'все' IN @Prompt('1. ТР','A',{'все', 'Т44', 'Т45', 'Т46', 'Т50', 'Т51', 'Т54', 'Т55', 'Т56', 'Т57', 'Т58', 'Т59', 'Т78', 'Т79', 'Т80', 'Т81', 'Т82', 'Т83', 'Т84', 'Т85', 'Т86', 'Т87', 'Т91', 'Т92', 'Т93', 'Т33', 'Т32', 'Т21', 'Т90', 'Т94', 'Т96', 'Т97', 'Т98', 'Т99', 'Т95', 'Т100'},multi,free) )
			and IND_CATEGORY in ('П','В','Н','H')
			Group by ITEM_NUM,IND_CATEGORY 
			),
	art2 as (
		SELECT   
			price.ITEM_NUM Артикул,
			price.IND_CATEGORY старая_категория
		FROM
			KDW.DW_PRICE_HISTORY price,
			art1
		WHERE
			( price.B_DATE< art1.Дата_смены and price.E_DATE >= art1.Дата_смены )
			and price.state='1'
			and (price.HSZ='064' or price.HSZ='Т33')
			AND ( price.DIV_CODE IN @Prompt('1. ТР','A',{'все', 'Т44', 'Т45', 'Т46', 'Т50', 'Т51', 'Т54', 'Т55', 'Т56', 'Т57', 'Т58', 'Т59', 'Т78', 'Т79', 'Т80', 'Т81', 'Т82', 'Т83', 'Т84', 'Т85', 'Т86', 'Т87', 'Т91', 'Т92', 'Т93', 'Т33', 'Т32', 'Т21', 'Т90', 'Т94', 'Т96', 'Т97', 'Т98', 'Т99', 'Т95', 'Т100'},multi,free)
						 OR 'все' IN @Prompt('1. ТР','A',{'все', 'Т44', 'Т45', 'Т46', 'Т50', 'Т51', 'Т54', 'Т55', 'Т56', 'Т57', 'Т58', 'Т59', 'Т78', 'Т79', 'Т80', 'Т81', 'Т82', 'Т83', 'Т84', 'Т85', 'Т86', 'Т87', 'Т91', 'Т92', 'Т93', 'Т33', 'Т32', 'Т21', 'Т90', 'Т94', 'Т96', 'Т97', 'Т98', 'Т99', 'Т95', 'Т100'},multi,free) )
			)
	SELECT
		art1.Артикул,
		art1.Дата_смены,
		art1.новая_категория,
		art2.старая_категория
	from art1, art2
	where art1.Артикул=art2.Артикул
	--and art1.новая_категория<> art2.старая_категория